Tekla.Structures.CatalogInternal.ShapeHandler
The ShapeImport interface.

Tekla.Structures.CatalogInternal.ShapeHandler.CatalogChanged
Event that triggers when the shape catalog has changed.

Tekla.Structures.CatalogInternal.ShapeHandler.Import(Tekla.Structures.CatalogInternal.ImportEntry)
Import a shape.
entry: Shape details.
Returns: The imported shape Tekla.Structures.Catalogs.ShapeItem at success.
Throws System.InvalidOperationException: Throws when import failed due to internal reason.
Throws System.ArgumentException: Throws when Fatal geometry error or Shape name already exists or Metadata error occurs.
Throws System.IO.FileNotFoundException: Throws when Geometry file not found or Metadata file not found.

Tekla.Structures.CatalogInternal.ShapeHandler.TryImport(Tekla.Structures.CatalogInternal.ImportEntry,Tekla.Structures.Catalogs.ShapeItem@)
Import a shape and returns the import result.
entry: Shape details.
shapeItem: Output shape item.
Returns: The import result.

Tekla.Structures.CatalogInternal.ShapeHandler.ImportOrGet(Tekla.Structures.CatalogInternal.ImportEntry)
Import a shape into the shape catalog. If, based on the geometric fingerprint
the shape is detected to be already existing in the catalog, the new shape is
not added and the old existing shape information is returned.
Returns:
The imported/recalled shape Tekla.Structures.Catalogs.ShapeItem at success.

Tekla.Structures.CatalogInternal.ShapeHandler.ExistsByBrep(Tekla.Structures.Geometry3d.FacetedBrep)
Determine if a shape exists in the catalog using a geometric fingerprint value calculated from its geometry
Returns:
Returns true if at least one shape matching the geometry fingerprint of the brep exists
in the catalog, false otherwise

Tekla.Structures.CatalogInternal.ShapeHandler.ExistsByFingerprint(System.String)
Use an externally provided geometric fingerprint value to determine if a similar shape exists in the catalog
Returns:
Returns true if at least one shape matching the geometry fingerprint exists in the catalog, false otherwise

Tekla.Structures.CatalogInternal.ShapeHandler.ExistsByName(System.String)
Use the shape name to determine if the shape exists in the catalog
Returns:
True if at least one shape matching the name exists in the catalog,
false otherwise

Tekla.Structures.CatalogInternal.ShapeHandler.CleanAndModifyByName(System.String,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)
Selects a shape by its name, then cleans and stores the shape into the shape catalog
name: An input parameter that defines the name of the shape to clean
cleaningParams: A reference to the shape cleaning parameters
isSolid: A reference that will get set to true if the result is a solid
Returns: True if cleaning and storing to catalog was successful

Tekla.Structures.CatalogInternal.ShapeHandler.InsertShapeAllowGeometricDuplicates(Tekla.Structures.Catalogs.ShapeItem@)
Inserts a shape including its geometry into the shape catalog of the model without checking if a
shape containing identical geometry already exists in the catalog
///
inputShape:
A reference to the ShapeItem to insert into the shape catalog, it also gets the resulting shape info BUT
NOTE that the geometry is not retrieved in the ShapeItem and will be NULL after the inserting!!!
Returns:
Return true on success.
using System;
using Tekla.Structures.CatalogInternal;
public class Example
{
public void InsertSimpleCube()
{
var vertices = new[]
{
new Vector(  0.0,   0.0,   0.0), // 0
new Vector(300.0,   0.0,   0.0), // 1
new Vector(300.0, 300.0,   0.0), // 2
new Vector(  0.0, 300.0,   0.0), // 3
new Vector(  0.0,   0.0, 300.0), // 4
new Vector(300.0,   0.0, 300.0), // 5
new Vector(300.0, 300.0, 300.0), // 6
new Vector(  0.0, 300.0, 300.0), // 7
};
var outloop = new[] { new[] { 0, 3, 2, 1 },
new[] { 0, 1, 5, 4 },
new[] { 1, 2, 6, 5 },
new[] { 2, 3, 7, 6 },
new[] { 3, 0, 4, 7 },
new[] { 4, 5, 6, 7 }};
var innerLoop = new Dictionary{int, int[][]}
{
};
var brep = new FacetedBrep(vertices, outloop, innerLoop);
var shapeItem = new ShapeItem
{
Name = "MyNiceCubeBrep",
ShapeFacetedBrep = brep,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = ShapeHandler.InsertShapeAllowGeometricDuplicates(shapeItem);
}
}

Tekla.Structures.CatalogInternal.ShapeHandler.GetAllShapeMetadata(System.String)
Gets the metadata of a shape
guid: An input parameter that defines the guid of the shape whose metadata we want to get
Returns: Returns a list of key-value pairs that contain the metadata of the shape specified by guid.
using System;
using Tekla.Structures.CatalogInternal;
public class Example
{
var polymesh = CreateBrep();
var shapeItem = new ShapeItem
{
Name = "TestShapeName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert();
var testPairs1 = new List{Tuple{string, string}}
{
new Tuple{string, string}("TestKey", "TestValue")
};
shapeItem.AppendMetadata(testPairs1));
var MetadataFromCatalog = ShapeHandler.GetAllShapeMetadata(shapeItem.Guid);
Assert.AreEqual(MetadataFromCatalog, testPairs1);
}

Tekla.Structures.CatalogInternal.ShapeHandler.GetHandlePoints(System.String)
Get the Shape Handle Points
guid:
Returns:

Tekla.Structures.CatalogInternal.ShapeHandler.CountShapeInstances
Returns the map of shape name and the number of shape instances in the model.
This sample shows how to call the Tekla.Structures.CatalogInternal.ShapeHandler.CountShapeInstances method to get the instance count for all shapes in the model
and check for the ones without instances.
public List<string> CountShapeInstancesTest()
{
var shapeSizeMap = ShapeHandler.CountShapeInstances();
var removedShapes = new List<String>();
foreach (var item in shapeSizeMap) {
{
if (item.Value == 0)
{
removedShapes.Add(item.Key);
}
}
return removedShapes;
}
Returns:
The Dictionary of the shape name and the number of shape instances in the model

Tekla.Structures.CatalogInternal.ShapeHandler.GetShapeLocation(System.String)
Returns location of shape file.
This sample shows how to call the Tekla.Structures.CatalogInternal.ShapeHandler.GetShapeLocation(System.String) method to get location of shape files on the disk.
Shapes added by the user in TS will be located in the Model folder.
using System;
using Tekla.Structures.CatalogInternal;
public class Example
{
var polymesh = CreateBrep();
var shapeItem = new ShapeItem
{
Name = "TestShapeName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
var result = shapeItem.Insert();
Assert.IsTrue(ShapeHandler.GetShapeLocation(shapeItem.Name).HasFlag(ShapeLocation.Model));
}
shapeName:
Returns: Location of shape files

Tekla.Structures.CatalogInternal.ShapeHandler.DeleteMetadata(System.String,System.String)
Delete the shape metadata by key
guid: An input parameter that defines the guid of the shape whose metadata we want to delete
metadataKey: The metadata key
This sample shows how to call the Tekla.Structures.CatalogInternal.ShapeHandler.DeleteMetadata(System.String,System.String) method to delete metadata from the shape.
public bool RemoveShapeMetadataTest(string shapeGuid, string metadataKey)
{
var shapeEnumerator = CatalogHandler.GetShapeItems();
shapeEnumerator.Reset();
while (shapeEnumerator.MoveNext())
{
var shape = shapeEnumerator.Current;
if (shape.Guid == shapeGuid)
{
return ShapeHandler.DeleteMetadata(shape.Guid, metadataKey);
}
}
return false;
}
Returns: True if success and False if key not found or deletion failed

Tekla.Structures.CatalogInternal.ShapeHandler.AppendMetadata(System.String,System.Collections.Generic.IList{System.Tuple{System.String,Tekla.Structures.CatalogInternal.ShapeMetadata}})
Appends metadata key-value pairs to the shape information. I
guid: An input parameter that defines the guid of the shape
keyValPairs: A list of the key-value pairs that define the metatadata to be added
public void InsertAndAddMetadataTest()
{
// NOTE: replace "[" and "]" with smaller than and larger than characters,
// had to be done like this due to doxygen XML clashing with C# syntax
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestFileName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
var testPairs = new List [Tuple[string, string]]
{
new Tuple[string, string] ("TestTAG", "testval"),
new Tuple[string, string] ("Volume", "1.01")
};
ShapeHandler.AppendMetadata(shapeItem.Guid, testPairs);
}
Returns:
True on success. Will return false and not add any metadata if even one key is empty.

Tekla.Structures.CatalogInternal.ShapeHandler.GetAllMetadataKeys(System.String)
Gets all metadata keys associated with the shape
guid: An input parameter that defines the guid of the shape
Returns: A list of strings containing the keys

Tekla.Structures.CatalogInternal.ShapeHandler.AddMetadataKeyVal(System.String,System.String,Tekla.Structures.CatalogInternal.ShapeMetadata)
Inserts a metadata key-value pair to this shape
guid: An input parameter that defines the guid of the shape
key: key that defines the metatadata key to be added
value: value to set for key. Value maximum length is 1023 characters
public void InsertMetadataTest()
{
var polymesh = CreateCubeBrepGeometry();
var shapeItem = new ShapeItem
{
Name = "TestShapeName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
var metadata = new ShapeMetadata("5.0", ShapeMetadataTypeEnum.Weight, "albl_Wt", "albl_Wt_desc");
ShapeHandler.AddMetadataKeyVal(shapeItem.Guid, "testKey", metadata);
}
Returns:
True on success. Will return false and not add any metadata if key is missing. Throws exceptions
according to type of error.

Tekla.Structures.CatalogInternal.ShapeHandler.UpdateMetadataKeyVal(System.String,System.String,Tekla.Structures.CatalogInternal.ShapeMetadata)
Updates the value of an existing key in the shape metadata
guid: An input parameter that defines the guid of the shape
key: Defines the existing metadata key to search for in shape
newValue: The new value to set for key///
public void UpdateMetadataKeyValTest()
{
var polymesh = CreateSomeValidBrep();
var shapeItem = new ShapeItem
{
Name = "TestShapeName",
ShapeFacetedBrep = polymesh,
UpAxis = ShapeUpAxis.Z_Axis
};
shapeItem.Insert();
ShapeHandler.AddMetadataKeyVal(shapeItem.Guid, "testKey", new ShapeMetadata("testVal", ShapeMetadataTypeEnum.Text, "", ""));
ShapeHandler.UpdateMetadataKeyVal(shapeItem.Guid, "testKey", new ShapeMetadata("NEWtestVal", ShapeMetadataTypeEnum.Text, "", ""));
}
Returns:
True on success. Will return false and not add any metadata if key is missing. Throws exceptions
according to type of error.

Tekla.Structures.CatalogInternal.ShapeHandler.GetMetadata(System.String,System.String)
Gets metadata value that is associated with the input key
guid: An input parameter that defines the guid of the shape
key: A non-empty string that defines the key in the Metadata key-value pair
Returns:
ShapeMetadata for key in this ShapeItem.
If either the key from metadata or the shape cannot be found, returns null.

Tekla.Structures.CatalogInternal.ShapeHandler.TriggerShapeCatalogChanged
Triggers the shape catalog changed event.